
&НаКлиенте
Процедура ЗагрузитьДанныеВПапку(Команда)
	Попытка
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтаФорма);
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;    
	НачатьПомещениеФайлов(ОписаниеОповещения, , ДиалогОткрытияФайла, Истина, УникальныйИдентификатор);

	Исключение
		Предупреждение("Внешний файл не загружен
		|"+ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	//ДиалогФайла.Фильтр = "Файл данных (*.xml)|*.xml";
	//Если ДиалогФайла.Выбрать() Тогда
	//	ИмяФайла = ДиалогФайла.ПолноеИмяФайла; 
	//	
	//КонецЕсли;  
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьВыборФайла(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт

    Если ПомещенныеФайлы = Неопределено Тогда
        Возврат;
	КонецЕсли;
    ЗагрузитьДанные(ПомещенныеФайлы[0]);	
	
КонецПроцедуры	


&НаСервере
Процедура ЗагрузитьДанные(Данные)
	ИмяФ = ПолучитьИмяВременногоФайла(".xml");
	ДанныеДвоичные = ПолучитьИзВременногоХранилища(Данные.Хранение);
	ДанныеДвоичные.Записать(ИмяФ);
	ОбработкаОбмена = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	ОбработкаОбмена.ИмяФайлаОбмена = ИмяФ;
	ОбработкаОбмена.РежимОбмена = "Загрузка";
	ОбработкаОбмена.ОткрытьФайлЗагрузки(Истина);
	ОбработкаОбмена.АрхивироватьФайл = Ложь;;
	ОбработкаОбмена.ВыполнитьЗагрузку(); 
	ОбработкаОбмена = Неопределено;  
КонецПроцедуры   