
&НаКлиенте
Процедура ВыгрузитьДанныеВПапку(Команда)
		    Попытка
		    ВыгрузитьДанные(ИмяФайла);
		    ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
		    ДвоичныеДанные.Записать(ИмяФайла);
		Исключение
		    Предупреждение("Внешний файл не сохранен
		    |"+ОписаниеОшибки());
		КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогФайла.Фильтр = "Файл данных (*.xml)|*.xml";
	ДиалогФайла.ПолноеИмяФайла = "Accounting_"+СтрЗаменить(Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"),".","-");
	Если ДиалогФайла.Выбрать() Тогда
		ИмяФайла = ДиалогФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ВыгрузитьДанные(ИмяФайлаОбмена)

    Обработка=Обработки.УниверсальныйОбменДаннымиXML.Создать();
    Обработка.РежимОбмена="Выгрузка";
    ВремФайл = ПолучитьИмяВременногоФайла("xml");
    МакетПравилОбмена = Обработки.JCI_СинхронизацияПеремещений.ПолучитьМакет("ПравилаВыгрузки");
    МакетПравилОбмена.Записать(ВремФайл);
    Обработка.ИмяФайлаПравилОбмена = ВремФайл;//ФайлПравилОбмена;
    Обработка.ЗагружатьДанныеВРежимеОбмена = Истина;
    Обработка.ЗаписыватьРегистрыНаборамиЗаписей = Истина;
    Обработка.ЗапоминатьЗагруженныеОбъекты = Истина;
    Обработка.ИспользоватьОтборПоДатеДляВсехОбъектов = Истина;
    Обработка.ДатаНачала = НачалоДня(ПериодВыгрузки.ДатаНачала);
    Обработка.ДатаОкончания = КонецДня(ПериодВыгрузки.ДатаОкончания);
    Обработка.ВыгружатьТолькоРазрешенные = Истина;
    Обработка.ИмяФайлаОбмена = ИмяФайлаОбмена;
    Обработка.ТипУдаленияРегистрацииИзмененийДляУзловОбменаПослеВыгрузки = 0; // 0 - не снимать регистрацию, 1 - снимать регистрацию
    Обработка.ЗагрузитьПравилаОбмена();
    Обработка.ВыполнитьВыгрузку();

КонецПроцедуры   